tuning/results/T2.2-flashinfer-moe-fp16/c16.out
  0%|          | 0/500 [00:00<?, ?it/s]Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xec947e8e3060>, trust_remote_code=False, seed=0, num_prompts=500, dataset_name='sharegpt', no_stream=False, dataset_path='/root/.cache/huggingface/sharegpt.json', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=16, model='cyankiwi/MiniMax-M2.7-AWQ-4bit', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-9b6f4727-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
100%|██████████| 500/500 [12:53<00:00,  1.55s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             16        
Benchmark duration (s):                  773.85    
Total input tokens:                      102498    
Total generated tokens:                  106411    
Request throughput (req/s):              0.65      
Output token throughput (tok/s):         137.51    
Peak output token throughput (tok/s):    161.00    
Peak concurrent requests:                20.00     
Total token throughput (tok/s):          269.96    
---------------Time to First Token----------------
Mean TTFT (ms):                          297.99    
Median TTFT (ms):                        296.05    
P50 TTFT (ms):                           296.05    
P95 TTFT (ms):                           377.62    
P99 TTFT (ms):                           391.67    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          112.07    
Median TPOT (ms):                        112.64    
P50 TPOT (ms):                           112.64    
P95 TPOT (ms):                           117.32    
P99 TPOT (ms):                           123.93    
---------------Inter-token Latency----------------
Mean ITL (ms):                           111.53    
Median ITL (ms):                         108.27    
P50 ITL (ms):                            108.27    
P95 ITL (ms):                            172.63    
P99 ITL (ms):                            203.24    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          24033.59  
Median E2EL (ms):                        19580.56  
P50 E2EL (ms):                           19580.56  
P95 E2EL (ms):                           67604.59  
P99 E2EL (ms):                           87937.85  
==================================================