tuning/results/T2.2-flashinfer-moe-fp16/c4.out
  0%|          | 0/500 [00:00<?, ?it/s]Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xe9ab1a40f380>, trust_remote_code=False, seed=0, num_prompts=500, dataset_name='sharegpt', no_stream=False, dataset_path='/root/.cache/huggingface/sharegpt.json', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=4, model='cyankiwi/MiniMax-M2.7-AWQ-4bit', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-08d15aa4-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
100%|██████████| 500/500 [20:59<00:00,  2.52s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             4         
Benchmark duration (s):                  1259.95   
Total input tokens:                      102498    
Total generated tokens:                  105899    
Request throughput (req/s):              0.40      
Output token throughput (tok/s):         84.05     
Peak output token throughput (tok/s):    94.00     
Peak concurrent requests:                8.00      
Total token throughput (tok/s):          165.40    
---------------Time to First Token----------------
Mean TTFT (ms):                          161.94    
Median TTFT (ms):                        162.84    
P50 TTFT (ms):                           162.84    
P95 TTFT (ms):                           215.38    
P99 TTFT (ms):                           225.37    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          46.83     
Median TPOT (ms):                        46.70     
P50 TPOT (ms):                           46.70     
P95 TPOT (ms):                           48.58     
P99 TPOT (ms):                           53.76     
---------------Inter-token Latency----------------
Mean ITL (ms):                           46.64     
Median ITL (ms):                         46.08     
P50 ITL (ms):                            46.08     
P95 ITL (ms):                            47.68     
P99 ITL (ms):                            93.90     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          10040.91  
Median E2EL (ms):                        8080.84   
P50 E2EL (ms):                           8080.84   
P95 E2EL (ms):                           28486.12  
P99 E2EL (ms):                           36635.31  
==================================================